
int main(int argc, char* argv[])
{
	//Считать из параметров командной строки путь ко входному файлу
	//Считать из параметров командной строки путь для выходного файла
	//Если удалось открыть входной файл и ошибок не обнаружено 
		//Считать данные из файла 
	//Иначе, если удалось открыть файл и ошибки были обнаружены
		//Вернуть все обнаруженные ошибки 
	//Иначе 
		//Вернуть ошибку о неудочном открытии файла
	//Закрыть файл
	//Если файл считан
		//Выполнить проверку - является ли граф деревом
		//Занести результат проверки в выходной файл

	//Завершить работу программы (вернуть параметр показывающий результат проверки)
	return 0;
}
